import pytest
import pandas as pd


@pytest.fixture
def sample_data():
    """Фикстура для предоставления тестовых данных."""
    data = {
        'Дата платежа': [
            '20.06.2025', '19.06.2025', '18.06.2025', '17.06.2025',
            '16.05.2025', '15.05.2025', '14.05.2025', '13.06.2025'
        ],
        'Статус': ['OK', 'OK', 'ERROR', 'OK', 'OK', 'OK', 'ERROR', 'OK'],
        'Категория': ['Переводы', 'Аптеки', 'Супермаркеты', 'Пополнения',
                      'Переводы', 'Аптеки', 'Супермаркеты', 'Пополнения'],
        'Номер карты': ['*5091', '*3456', '*4959', '', '*4959', '*4959', '*3456', ''],
        'Сумма платежа': [100.00, 50.00, 50.00, 200.00, 150.00, 50.00, 200.00, 150.00],
        'Описание': [
            'Сергей Г.', 'Аптека Вита', 'Магнит', 'Олег М.', 'Сергей Г.', 'Аптека Вита', 'Магнит', 'Олег М.',]
    }

    return pd.DataFrame(data)


@pytest.fixture
def sample_data_empty():
    empty_df = pd.DataFrame(columns=["Статус", "Категория"])
    return empty_df
